<template>
  <div>
    <div id="container">
      <div id="title">免责及隐私说明</div>
      <div id="text">
        <p>
        1书林学术平台提供服务的具体内容由平台运营公司根据实际情况提供，本平台仅对自身提供的服务承担责任；</p><p>
        2您了解书林学术平台上的信息系有其他用户自行发布的，且可能存在风险和瑕疵。书林学术平台仅作为您获取服务信息的平台，但书林学术平台无法控制信息的真实性或准确性。您应自行谨慎判断确定信息的真实性、合法性和有效性，并自行承担相关风险；</p><p>
        3出法律法规明确规定，或出现以下情形外，书林学术平台没有义务对所有用户的注册数据、服务信息等进行事先筛查：</p><p>
        3.1书林学术平台有合理理由认为特定用户可能存在重大违法或违约的情形；</p><p>
        3.2书林学术平台有合理理由认为用户在平台的行为涉嫌违法或不当；</p><p>
        3.3书林学术平台上的信息随时会因为其他用户发生变动，平台不就此作出特别通知。您知悉并理解由于网站上信息数量极其庞大，虽然书林学术平台会尽合理的最大的努力保证您所浏览的信息的准确性和迅捷性，但由于众所周知的互联网技术因素等客观原因，书林学术平台显示的信息可能存在一定的滞后性和差错，由此给您带来的不便或铲射相应问题，书林学术平台不承担责任。</p><p>
        3.4用户明确同意其使用平台运营公司网络服务所存在的风险将完全由自己承担。用户理解并接受下载或获取任何信息资料取决于用户自己，并由其承担系统受损、资料丢失以及其它任何风险。平台对在服务网上进行的交易进程，都不作担保。</p><p>
        3.5您理解并同意，书林学术平台不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于使用、数据等方面的损失或其他无形损失的损害赔偿（无论书林学术平台是否已被告知该损害赔偿的可能性）：</p><p>
        3.5.1第三方未经批准的使用您的账户或更改您的数据；您的传输或数据遭到未授权的存取或变更；</p><p>
        3.5.2任和第三方在本服务中所作之声明或行为；任何非书林学术平台的原因而引起的与书林学术平台服务有关的其他损失；</p><p>
        3.5.3您对书林学术平台服务的误解；</p><p>
        3.5.4您理解并同意，书林学术平台及其关联公司并非司法机构，无法保证您和第三方的争议处理结果符合您的期望，也不对争议调节结论承担任何责任。</p><p>
        3.5.5不论在任何情况，书林学术平台均不对由于起义、骚乱、火灾、罢工、洪水、疫情等不可抗力而造成的不能服务或延迟服务承担责任。</p><p>
        4平台运营公司有权与任何时间暂时或永久修改或终止本服务（或其任何部分），而无论其通知与否，平台运营公司对用户和第三人均无需承担任何责任。</p><p>
      &nbsp;</p>
      </div>
    </div>
  </div>
</template>

<style scoped>
#container{
  width: 55%;
  margin: 3% auto;
  border-radius: 5%;
  border: 2px lightgray solid;
  box-shadow: lightgray 1px 1px 2px 2px;
  padding: 20px;
}
#title{
  text-align: center;
  font-size: 36px;
  font-weight: bold;
}
#text{
  font-size: 18px;
  margin-top: 10px;
  line-height: 28px;
}
</style>

<script>
// @ is an alias to /src

export default {
  name: 'agreementView',
  data() {
    return {
    };
  },

  methods: {}
}
</script>